boggg_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "LUKE"], ["description", "LEAH"], ["created_at", "2016-04-30 00:23:48.283443"], ["updated_at", "2016-04-30 00:23:48.283443"]]
---
  def create
    @creature = Creature.create(creature_params)

UPDATE "creatures" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["name", "Luke!!!"], ["description", "Jedi!!!"], ["updated_at", "2016-04-30 00:24:19.649176"], ["id", 1]]
---
  def update
    @creature.update(creature_params)

DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 3]]
---
  def destroy
    @creature.destroy

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 3]]
---
  def set_creature
    @creature = Creature.find(params[:id])