bogggg_app/app/controllers/creatures_controller.rb

  def create
    @creature = Creature.create(creature_params)
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "LUKE"], ["description", "LEAH"], ["created_at", "2016-04-30 00:48:32.356369"], ["updated_at", "2016-04-30 00:48:32.356369"]]

  def update
    @creature.update(creature_params)
---
UPDATE "creatures" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["name", "Luke!!!"], ["description", "Jedi!!!!1"], ["updated_at", "2016-04-30 00:48:23.040684"], ["id", 1]]

  def destroy
    @creature.destroy
---
DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 3]]

  def set_creature
    @creature = Creature.find(params[:id])
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 3]]