app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "TEST"], ["description", "TEST!!!!"], ["created_at", "2016-04-29 21:56:55.446218"], ["updated_at", "2016-04-29 21:56:55.446218"]]
---
  def create
    Creature.create(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @creature = Creature.find(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @creature = Creature.find(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "creatures" SET "name" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["name", "TEST!!!"], ["updated_at", "2016-04-29 21:59:33.138048"], ["id", 3]]
---
  def update
    @creature = Creature.find(creature_id)
    @creature.update(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 3]]
---
  def destroy
    @creature = Creature.find(creature_id)
    @creature.destroy