bog_app/bog_app/bog_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "TEST"], ["description", "111111"], ["created_at", "2016-05-02 01:52:54.370522"], ["updated_at", "2016-05-02 01:52:54.370522"]]
---
  def create
    creature_params = params.require(:creature).permit(:name, :description)
    Creature.create(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 5]]
---
  def edit
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "creatures" SET "description" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["description", "111111"], ["updated_at", "2016-05-02 04:19:39.553810"], ["id", 5]]
---
  def update
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature_params = params.require(:creature).permit(:name, :description)
    creature.update_attributes(creature_params)